Revit 2021.1 API
RebarInSystem Methods
The RebarInSystem type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
DoesBarExistAtPosition
 Checks whether a bar exists at the specified position.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetBarPositionTransform
 Return a transform representing the relative position of any individual bar in the set.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves
 A chain of curves representing the centerline of the rebar.
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetDistributionPath
 The distribution path of a rebar set.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetHostId
 The element that contains the rebar.
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPresentationMode
 Gets the presentaion mode for this rebar set when displayed in the given view.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasPresentationOverrides
 Identifies if this RebarInSystem has overridden default presentation settings for the given view.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsRebarInSection
 Identifies if this RebarInSystem is shown as a cross-section in the given view.
IsSolidInView
 Checks if this rebar element is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if this rebar element is shown unobscured in a view.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
SetSolidInView
 Sets this rebar element to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets RebarInSystem element to be shown unobscured in a view.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace